REGION_KEYWORD_MAP = {
    '강원': ['강원', '강릉', '동해', '삼척', '속초', '원주', '춘천', '태백', '고성', '양구', '양양', '영월', '인제', '정선', '철원', '평창', '홍천', '화천', '횡성'],
    '경상/대구/울산/부산': ['경상', '대구', '울산', '부산', '경산', '경주', '구미', '김천', '문경', '상주', '안동', '영주', '영천', '포항', '고령', '봉화',
                    '성주', '영덕', '영양', '예천', '울릉', '울진', '의성', '청도', '청송', '칠곡', '창원', '거제', '김해', '밀양', '사천', '양산',
                    '진주', '통영', '거창', '고성', '남해', '산청', '의령', '창녕', '하동', '함안', '함양', '합천'],
    '전라/광주': ['전라', '광주', '군산', '김제', '남원', '익산', '전주', '정읍', '고창', '무주', '부안', '순창', '완주', '임실', '장수', '진안', '목포',
              '여수', '순천', '나주', '광양', '담양', '곡성', '구례', '고흥', '보성', '화순', '장흥', '강진', '해남', '영암', '무안', '함평', '영광',
              '장성', '완도', '진도', '신안'],
    '제주': ['제주', '서귀포'],
    '충청/대전/세종': ['충청', '대전', '세종', '제천', '청주', '충주', '괴산', '단양', '보은', '영동', '옥천', '음성', '증평', '진천', '계룡', '공주', '논산',
                 '당진', '보령', '서산', '아산', '천안', '금산', '부여', '서천', '예산', '청양', '태안', '홍성'],
    '경기/인천': ['경기', '인천', '수원', '고양', '용인', '화성', '성남', '의정부', '안양', '부천', '광명', '평택', '동두천', '안산', '과천', '구리', '남양주',
              '오산', '시흥', '군포', '의왕', '하남', '파주', '이천', '안성', '김포', '광주', '양주', '포천', '여주', '연천', '가평', '양평'],
    '서울': ['서울'],
    '온라인': ['온라인'],
}

# 3. 세미나/강연으로 분류할 키워드
SEMINAR_KEYWORDS = ['세미나', '아카데미', '공부모임', '영화제', '글쓰기', '북토크', '강연', '전시', '플리마켓', '기획전시', '상영회', '토론회', '강좌']